src/tr069/samples/tr069_get_parameter_values_root_req.xml

<soapenv:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
      <cwmp:ID soapenv:mustUnderstand="1">1234</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
      <cwmp:GetParameterValues>
	<ParameterNames soap:arrayType="xsd:string[1]">
	  <string>InternetGatewayDevice.</string>
	</ParameterNames>
      </cwmp:GetParameterValues>
    </soapenv:Body>
</soapenv:Envelope>
